Revit 2026 API

# ThermalPropertiesHeatTransferCoefficient Property

---

The heat transfer coefficient value (U-Value). The unit is watts per meter-squared kelvin (W/(m^2*K)).

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double HeatTransferCoefficient { get; }
```
```vb
Public ReadOnly Property HeatTransferCoefficient As Double
	Get
```
```cpp
public:
property double HeatTransferCoefficient {
	double get ();
}
```
```fsharp
member HeatTransferCoefficient : float with get
```

#### Property Value

Double

#### Reference

ThermalProperties Class

Autodesk.Revit.DB Namespace